# SQL Queries: Navigating a database

## Setup

We are now installing the necessary packages to interact with the MySQL database and issue SQL queries using the notebook.

In [ ]:
!apt-get install python3-mysqldb
!pip3 install -U sqlalchemy sql_magic

In [1]:
%reload_ext sql_magic

In [2]:
from sqlalchemy import create_engine

conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host = 'db.ipeirotis.org', 
    user = 'student',
    password = 'dwdstudent2015',
    encoding = 'utf-8')
engine = create_engine(conn_string)

In [3]:
%config SQL.conn_name = 'engine'

## Navigation Queries

In [4]:
%%read_sql
show databases

Query started at 04:13:55 AM UTC; Query executed in 0.01 m

             Database
0  information_schema
1        bike_sharing
2            citibike
3   citibike_fall2017
4            facebook
5                imdb
6               music
7     nypd_complaints
8              public

In [5]:
%%read_sql
use imdb

Query started at 04:13:57 AM UTC; Query executed in 0.00 m

In [6]:
%%read_sql
show tables

Query started at 04:13:59 AM UTC; Query executed in 0.00 m

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [7]:
%%read_sql
describe actors

Query started at 04:14:00 AM UTC; Query executed in 0.00 m

        Field          Type Null  Key Default Extra
0          id       int(11)   NO  PRI       0
1  first_name  varchar(100)  YES  MUL    None
2   last_name  varchar(100)  YES  MUL    None
3      gender       char(1)  YES         None

In [8]:
%%read_sql
describe movies

Query started at 04:14:04 AM UTC; Query executed in 0.00 m

  Field          Type Null  Key Default Extra
0    id       int(11)   NO  PRI       0
1  name  varchar(100)  YES  MUL    None
2  year       int(11)  YES         None
3  rank         float  YES         None

In [9]:
%%read_sql
describe roles

Query started at 04:14:05 AM UTC; Query executed in 0.00 m

      Field          Type Null  Key Default Extra
0  actor_id       int(11)  YES  MUL    None
1  movie_id       int(11)  YES  MUL    None
2      role  varchar(100)  YES  MUL    None

In [10]:
%%read_sql
use facebook

Query started at 04:14:07 AM UTC; Query executed in 0.00 m

In [11]:
%%read_sql
show tables

Query started at 04:14:15 AM UTC; Query executed in 0.00 m

  Tables_in_facebook
0      Concentration
1      FavoriteBooks
2     FavoriteMovies
3      FavoriteMusic
4    FavoriteTVShows
5            Hobbies
6         LookingFor
7        Orientation
8           Profiles
9       Relationship

In [12]:
%%read_sql
describe Profiles

Query started at 04:14:32 AM UTC; Query executed in 0.00 m

             Field          Type Null  Key Default Extra
0        ProfileID       int(11)   NO  PRI    None
1             Name  varchar(255)  YES         None
2      MemberSince      datetime  YES         None
3       LastUpdate      datetime  YES         None
4           School  varchar(255)  YES         None
5           Status  varchar(255)  YES         None
6              Sex  varchar(255)  YES         None
7         Birthday      datetime  YES         None
8              AIM  varchar(255)  YES         None
9          Website  varchar(255)  YES         None
10  PoliticalViews  varchar(255)  YES         None
11       Geography  varchar(255)  YES         None
12      HighSchool  varchar(255)  YES         None
13        HomeTown  varchar(255)  YES         None
14       HomeState  varchar(255)  YES         None
15       Residence  varchar(255)  YES         None
16  CurrentAddress  varchar(255)  YES         None
17     CurrentTown  varchar(255)  YES         None
18    CurrentState  varchar(255)  YES         None